[
    {
      "username": "Blanka",
      "discordusername": "cryblanka",
      "quote": "No gil nooooo...",
      "rank": ["WGD", "BD"]
    },
    {
      "username": "YumYummity",
      "discordusername": "yumyummityyum",
      "quote": "I never thought Guilded would do something like this. When I first came to Guilded, I saw great potential. This update ruins it all.",
      "rank": ["WGD", "BD"]
    },
    {
      "username": "Skyy",
      "discordusername": "skeptical043",
      "quote": "Guilded is not Guilded anymore, it was supposed to be an independant project, even ROBLOX (apparantly) themselves said it that Guilded will continue operating as a independant project. To me, doesn't seem like this promise was fulfilled. Come back Guilded, listen to your community.",
      "rank": ["GG"]
    },
    {
      "username": "Nizuke",
      "discordusername": "nizuke_yn",
      "quote": "Guilded is Guilded, Roblox is Roblox. Check again your place! Guilded mean friends, Roblox mean money. Check again your place!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "PrettyGoodName",
      "discordusername": "prettygoodname",
      "quote": "As someone who invested 4 years into Guilded by promoting it, growing my community in it, building bots, becoming a Guilded partner, to see Guilded rejecting me, people I knew, my community, my bots and much of what I love about Guilded is absolutely devastating.",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "Nathaniel",
      "discordusername": "itznxthaniel",
      "quote": "I am against this change. Guilded needs to listen to it's community.",
      "rank": ["WGD", "GPartner", "GG"]
    },
    {
      "username": "Xyphien",
      "discordusername": "xyphien",
      "quote": "Roblox Chat is the worst thing ever, they need to leave and turn it back into Guilded. I hope the ceo and everyone directly involved with this change finds that every soda they drink is pre shaken up!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "NotABadBud",
      "discordusername": "notabadbud",
      "quote": "Listen, i’m not sure if 3 years on this platform is counted as OG but i’m tired of it. Roblox having their own place to discuss should be outside of guilded, I swear the shit in my toilet has more redeeming qualities than this change and i’m DONE. After 3 years on this platform (gosh why do I feel old saying that) I quit.",
      "rank": []
    },
    {
      "username": "Atlas",
      "discordusername": "atlas",
      "quote": "Guilded was there to pick me and my community up when the name changes on discord forced me to realize that discord had gone full corporation. I found it insulting that just because my server was making money that i got my username change long before other partners who had been there since the beginning. So i left and started building on guilded, and while i love the community, the team, the partners, the staff. This change feels like a stab in the back. No discussion, no heads up, just do it or lose your account and community. ",
      "rank": ["GPartner", "GG"]
    },
    {
        "username": "magicbotman",
        "discordusername": "magicbotman",
        "quote": "This change is resulting in the shutdown of every major bot and most large communities. Roblox needs to listen to the community, or they will kill Guilded.\n- magicbotman",
        "rank": ["GG", "GPartner"]
    },
    {
        "username": "MrPiglr",
        "discordusername": "mrpiglr",
        "quote": "As a Guilded Partner, I do not agree with this change. Not only does it restrict the platform to just robloxians, It has stripped developers, streamers, and enthusiasts of a place they called home. Not a good move ROBLOX.",
        "rank": ["GPartner"]
    },
    {
        "username": "Fanboy",
        "discordusername": "angrybirdsfanboy06",
        "quote": "As a Roblox Player who has been playing Roblox for over 7 years now and a huge fan of Guilded, you are unknowingly shutting down Roblox Guilded servers that HEAVILY use Guilded bots like ParrotBot and Yuki that DONT agree with you doing this. Kinda ironic that THIS was suppose to benefit Roblox users, yet its making an opposite effect?",
        "rank": []
    },
    {
        "username": "Des",
        "discordusername": "heyimdes",
        "quote": "I’ve been using Guilded since 2021. It’s been a massive part of my life, period. Guilded does not need to have any part with Roblox. When the merger happened, we were promised that it would only mean more extra funding and in turn more updates for Guilded. That promise was broken. I love Guilded, even if (as my friends know), I tend to be inactive at times. We don’t want this change.",
        "rank": []
    },
    {
        "username": "DcHelper29",
        "discordusername": "dchelper29",
        "quote": "Roblox, leave Guilded alone, or I quit.",
        "rank": []
    },
    {
        "username": "Razur",
        "discordusername": "lord_razur",
        "quote": "I've migrated a few small communities over to Guilded and actively used it for nearly the past 2 years. We've all appreciated the extra features, the QOL, but most importantly how the team actually seemed to listen to their community. Frankly, I'm not happy with the prospect of moving elsewhere, but the idea that you'll need a completely separate account to continue using something that was promised to remain wholly independent is enough to send all of us away. This is simply not a reasonable option for us and I know a majority of people on this platform believe the same. Your established communities and most avid supporters don't want this, I'm sure your devs don't want this, nobody wants this.",
        "rank": []
    },
    {
        "username": "Wade",
        "discordusername": "wapg",
        "quote": "I see Guilded's decision as a rejection of a significant portion of the community that wasn't here for ROBLOX. Many of us joined, wanting a place to chat and hang out elsewhere than on Discord, and now they've required us, forced us to create a ROBLOX account that many won't even use. This feels like the first step toward full integration with the ROBLOX platform, that nobody asked for.",
        "rank": ["GG"]
    },
    {
      "username": "æ.",
      "discordusername": "aedoesthings",
      "quote": "Ever since I joined Guilded I was truly impressed. I had a lot of hope for the platform and was willing to switch to it, which I did. I even took a step further by joining Gil Gang, becoming an embassador of Guilded. I, along many others, were fine with Roblox owning Guilded, as long as it wasn't taken too far.  That is, until May 31st, where all my trust was lost in the platform. On July 15th, all my memories on this previously amazing platform will be wiped off, servers will have switched and the entire former community will be gone. All of this, because of a corporate decision. Yes, I will miss the platform, but it has gone too far and my trust has been lost.",
      "rank": ["GG"]
    },
    {
        "username": "KensonPlays",
        "discordusername": "kensonplays",
        "quote": "Guilded offered our community what a lot of us couldn't afford on Discord. Nitro functionality for free. We all loved being able to use the emotes globally without paying money for what we felt was such a basic feature. We also loved the fact we could have a custom URL without spending a ton of money on boosts or Partnership (which isn't possible on Discord anymore). While we eventually got a Guilded Partnership, that wasn't what we were aiming for. We just wanted a community platform that offered everything we wanted and more, at minimal to no cost. Guilded offered that to us. But 99% of our community has ZERO interest in Roblox, and refuses to make an account. Some of my members are already planning to delete their account before the cutoff period.",
        "rank": ["GPartner", "GG"]
    },
    {
        "username": "⛧ Versyssa ⛧",
        "discordusername": "versyssa",
        "quote": "4 years backing (my partnerversary was a couple months away) and repping Guilding, bringing a couple hundred people over only to get slapped in the face. I'm so disappointed in them right now.",
        "rank": []
    },
    {
        "username": "Silly Goober",
        "discordusername": "silly_goober720",
        "quote": "This is just horrible, a whole platform destroyed by a corrupt corporation. Not even asking us if we are for it. Freedom is not even an option because of these guys. The truth is money corrupts these guys and they need a reality check. RIP Guilded i will always miss you...",
        "rank": []
    },
    {
        "username": "NotEvilbook",
        "discordusername": "notevilbook",
        "quote": "Really Roblox, are you gonna force people to use their Roblox account to access guilded? I mean, people are going to be very disappointed after the time reached. Roblox, if you seeing this, please just revert the login requirement update and everything will be fine.",
        "rank": []
    }
  ]
