[
    {
      "username": "Blanka",
      "discordusername": "cryblanka",
      "quote": "No gil nooooo...",
      "rank": ["BD"]
    },
    {
      "username": "YumYummity",
      "discordusername": "yumyummityyum",
      "quote": "",
      "rank": ["BD"]
    },
    {
      "username": "Skyy",
      "discordusername": "skeptical043",
      "quote": "Guilded is not Guilded anymore, it was supposed to be an independant project, even ROBLOX (apparantly) themselves said it that Guilded will continue operating as a independant project. To me, doesn't seem like this promise was fulfilled. Come back Guilded, listen to your community.",
      "rank": ["GG"]
    },
    {
      "username": "Nizuke",
      "discordusername": "nizuke_yn",
      "quote": "Guilded is Guilded, Roblox is Roblox. Check again your place! Guilded mean friends, Roblox mean money. Check again your place!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "PrettyGoodName",
      "discordusername": "prettygoodname",
      "quote": "As someone who invested 4 years into Guilded by promoting it, growing my community in it, building bots, becoming a Guilded partner, to see Guilded rejecting me, people I knew, my community, my bots and much of what I love about Guilded is absolutely devastating.",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "Nathaniel",
      "discordusername": "itznxthaniel",
      "quote": "I am against this change. Guilded needs to listen to it's community.",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "Xyphien",
      "discordusername": "xyphien",
      "quote": "Roblox Chat is the worst thing ever, they need to leave and turn it back into Guilded. I hope the ceo and everyone directly involved with this change finds that every soda they drink is pre shaken up!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "NotABadBud",
      "discordusername": "notabadbud",
      "quote": "Listen, i’m not sure if 3 years on this platform is counted as OG but i’m tired of it. Roblox having their own place to discuss should be outside of guilded, I swear the shit in my toilet has more redeeming qualities than this change and i’m DONE. After 3 years on this platform (gosh why do I feel old saying that) I quit.",
      "rank": []
    },
    {
      "username": "Atlas",
      "discordusername": "atlas",
      "quote": "Guilded was there to pick me and my community up when the name changes on discord forced me to realize that discord had gone full corporation. I found it insulting that just because my server was making money that i got my username change long before other partners who had been there since the beginning. So i left and started building on guilded, and while i love the community, the team, the partners, the staff. This change feels like a stab in the back. No discussion, no heads up, just do it or lose your account and community. ",
      "rank": ["GPartner", "GG"]
    },
    {
        "username": "magicbotman",
        "discordusername": "magicbotman",
        "quote": "This change is resulting in the shutdown of every major bot and most large communities. Roblox needs to listen to the community, or they will kill Guilded.\n- magicbotman",
        "rank": ["GG", "GPartner"]
    },
    {
        "username": "MrPiglr",
        "discordusername": "mrpiglr",
        "quote": "As a Guilded Partner, I do not agree with this change. Not only does it restrict the platform to just robloxians, It has stripped developers, streamers, and enthusiasts of a place they called home. Not a good move ROBLOX.",
        "rank": ["GPartner"]
    },
    {
        "username": "Fanboy",
        "discordusername": "angrybirdsfanboy06",
        "quote": "As a Roblox Player who has been playing Roblox for over 7 years now and a huge fan of Guilded, you are unknowingly shutting down Roblox Guilded servers that HEAVILY use Guilded bots like ParrotBot and Yuki that DONT agree with you doing this. Kinda ironic that THIS was suppose to benefit Roblox users, yet its making an opposite effect?",
        "rank": []
    }
  ]
