[
    {
      "username": "Blanka",
      "discordusername": "cryblanka",
      "quote": "No gil nooooo...",
      "rank": ["WGD", "BD"]
    },
    {
      "username": "YumYummity",
      "discordusername": "yumyummityyum",
      "quote": "I never thought Guilded would do something like this. When I first came to Guilded, I saw great potential. This update ruins it all.",
      "rank": ["WGD", "BD"]
    },
    {
      "username": "Skyy",
      "discordusername": "skeptical043",
      "quote": "Guilded is not Guilded anymore, it was supposed to be an independant project, even ROBLOX (apparantly) themselves said it that Guilded will continue operating as a independant project. To me, doesn't seem like this promise was fulfilled. Come back Guilded, listen to your community.",
      "rank": ["GG"]
    },
    {
      "username": "Nizuke",
      "discordusername": "nizuke_yn",
      "quote": "Guilded is Guilded, Roblox is Roblox. Check again your place! Guilded mean friends, Roblox mean money. Check again your place!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "PrettyGoodName",
      "discordusername": "prettygoodname",
      "quote": "As someone who invested 4 years into Guilded by promoting it, growing my community in it, building bots, becoming a Guilded partner, to see Guilded rejecting me, people I knew, my community, my bots and much of what I love about Guilded is absolutely devastating.",
      "rank": ["GPartner", "GG", "BD"]
    },
    {
      "username": "Nathaniel",
      "discordusername": "itznxthaniel",
      "quote": "I am against this change. Guilded needs to listen to it's community.",
      "rank": ["WGD", "GPartner", "GG", "BD"]
    },
    {
      "username": "Xyphien",
      "discordusername": "xyphien",
      "quote": "Roblox Chat is the worst thing ever, they need to leave and turn it back into Guilded. I hope the ceo and everyone directly involved with this change finds that every soda they drink is pre shaken up!",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "NotABadBud",
      "discordusername": "notabadbud",
      "quote": "Listen, i’m not sure if 3 years on this platform is counted as OG but i’m tired of it. Roblox having their own place to discuss should be outside of guilded, I swear the shit in my toilet has more redeeming qualities than this change and i’m DONE. After 3 years on this platform (gosh why do I feel old saying that) I quit.",
      "rank": []
    },
    {
      "username": "Atlas",
      "discordusername": "atlas",
      "quote": "Guilded was there to pick me and my community up when the name changes on discord forced me to realize that discord had gone full corporation. I found it insulting that just because my server was making money that i got my username change long before other partners who had been there since the beginning. So i left and started building on guilded, and while i love the community, the team, the partners, the staff. This change feels like a stab in the back. No discussion, no heads up, just do it or lose your account and community. ",
      "rank": ["GPartner", "GG"]
    },
    {
        "username": "magicbotman",
        "discordusername": "magicbotman",
        "quote": "This change is resulting in the shutdown of every major bot and most large communities. Roblox needs to listen to the community, or they will kill Guilded.\n- magicbotman",
        "rank": ["GG", "GPartner"]
    },
    {
        "username": "MrPiglr",
        "discordusername": "mrpiglr",
        "quote": "As a Guilded Partner, I do not agree with this change. Not only does it restrict the platform to just robloxians, It has stripped developers, streamers, and enthusiasts of a place they called home. Not a good move ROBLOX.",
        "rank": ["GPartner"]
    },
    {
        "username": "Fanboy",
        "discordusername": "angrybirdsfanboy06",
        "quote": "As a Roblox Player who has been playing Roblox for over 7 years now and a huge fan of Guilded, you are unknowingly shutting down Roblox Guilded servers that HEAVILY use Guilded bots like ParrotBot and Yuki that DONT agree with you doing this. Kinda ironic that THIS was suppose to benefit Roblox users, yet its making an opposite effect?",
        "rank": []
    },
    {
        "username": "Des",
        "discordusername": "heyimdes",
        "quote": "I’ve been using Guilded since 2021. It’s been a massive part of my life, period. Guilded does not need to have any part with Roblox. When the merger happened, we were promised that it would only mean more extra funding and in turn more updates for Guilded. That promise was broken. I love Guilded, even if (as my friends know), I tend to be inactive at times. We don’t want this change.",
        "rank": []
    },
    {
        "username": "DcHelper29",
        "discordusername": "dchelper29",
        "quote": "Roblox, leave Guilded alone, or I quit.",
        "rank": []
    },
    {
        "username": "Razur",
        "discordusername": "lord_razur",
        "quote": "I've migrated a few small communities over to Guilded and actively used it for nearly the past 2 years. We've all appreciated the extra features, the QOL, but most importantly how the team actually seemed to listen to their community. Frankly, I'm not happy with the prospect of moving elsewhere, but the idea that you'll need a completely separate account to continue using something that was promised to remain wholly independent is enough to send all of us away. This is simply not a reasonable option for us and I know a majority of people on this platform believe the same. Your established communities and most avid supporters don't want this, I'm sure your devs don't want this, nobody wants this.",
        "rank": []
    },
    {
        "username": "Wade",
        "discordusername": "wapg",
        "quote": "I see Guilded's decision as a rejection of a significant portion of the community that wasn't here for ROBLOX. Many of us joined, wanting a place to chat and hang out elsewhere than on Discord, and now they've required us, forced us to create a ROBLOX account that many won't even use. This feels like the first step toward full integration with the ROBLOX platform, that nobody asked for.",
        "rank": ["GG", "BD"]
    },
    {
      "username": "æ.",
      "discordusername": "aedoesthings",
      "quote": "Ever since I joined Guilded I was truly impressed. I had a lot of hope for the platform and was willing to switch to it, which I did. I even took a step further by joining Gil Gang, becoming an embassador of Guilded. I, along many others, were fine with Roblox owning Guilded, as long as it wasn't taken too far.  That is, until May 31st, where all my trust was lost in the platform. On July 15th, all my memories on this previously amazing platform will be wiped off, servers will have switched and the entire former community will be gone. All of this, because of a corporate decision. Yes, I will miss the platform, but it has gone too far and my trust has been lost.",
      "rank": ["GG"]
    },
    {
        "username": "KensonPlays",
        "discordusername": "kensonplays",
        "quote": "Guilded offered our community what a lot of us couldn't afford on Discord. Nitro functionality for free. We all loved being able to use the emotes globally without paying money for what we felt was such a basic feature. We also loved the fact we could have a custom URL without spending a ton of money on boosts or Partnership (which isn't possible on Discord anymore). While we eventually got a Guilded Partnership, that wasn't what we were aiming for. We just wanted a community platform that offered everything we wanted and more, at minimal to no cost. Guilded offered that to us. But 99% of our community has ZERO interest in Roblox, and refuses to make an account. Some of my members are already planning to delete their account before the cutoff period.",
        "rank": ["GPartner", "GG"]
    },
    {
        "username": "⛧ Versyssa ⛧",
        "discordusername": "versyssa",
        "quote": "4 years backing (my partnerversary was a couple months away) and repping Guilding, bringing a couple hundred people over only to get slapped in the face. I'm so disappointed in them right now.",
        "rank": ["GPartner"]
    },
    {
        "username": "Silly Goober",
        "discordusername": "silly_goober720",
        "quote": "This is just horrible, a whole platform destroyed by a corrupt corporation. Not even asking us if we are for it. Freedom is not even an option because of these guys. The truth is money corrupts these guys and they need a reality check. RIP Guilded i will always miss you...",
        "rank": []
    },
    {
        "username": "NotEvilbook",
        "discordusername": "notevilbook",
        "quote": "Really Roblox, are you gonna force people to use their Roblox account to access guilded? I mean, people are going to be very disappointed after the time reached. Roblox, if you seeing this, please just revert the login requirement update and everything will be fine.",
        "rank": []
    },
    {
        "username": "AcousticJamm",
        "discordusername": "acousticjamm",
        "quote": "It's going to be a hard and uncertain time without Guilded. I made a lot of my friends from the platform, it's difficult to watch it die.",
        "rank": ["GG"]
    },
    {
        "username": "❀ Takashi Golbach ❀",
        "discordusername": "takashigolbach",
        "quote": "Even though I've only really made a Guilded account to try out the platform because it was interesting. But I kinda had a feeling something like this was gonna happen. It sucks that cool platforms like these end up being having freedom to just soulless corporate stuff. However, some things I really liked about Guilded is the free customization options, variety of channels, gradient roles, and lots more. ",
        "rank": []
    },
    {
      "username": "1xgr",
      "discordusername": "1xgrr",
      "quote": "This platform was doing great honestly. Roblox themselves had their own thing going on by bringing back events while still giving Guilded the little attention they needed to move forward. All good things must come to an end however as they then released this awful update. As much as this update doesn't affect me nor could really give two fucks, I've taken people's opinions into consideration and therefore I'm against this change because I can understand how annoying it can be.",
      "rank": []
    },
    {
        "username": "Sandra",
        "discordusername": "doctorenigmamrpn",
        "quote": "As someone who was one of the pioneers moving the RP community to Guilded. This is arguably one of the largest gut punches I ever have recieved. Guilded was one of the good ones, and I've had my eye on them since all the way back in 2018. The fact this happened, it's a massive disappointment in every way. My entire lifeswork is having to up and move again, after all the effort I took to make RPGbot work on there, and make it easier for all RP servers to move there. Introducing the concept of RP hubs with Rosehaven, and everything.",
        "rank": ["GPartner", "GG"]
    },
    {
        "username": "GodSparing",
        "discordusername": "yuta_tester",
        "quote": "Roblox = Bozolox",
        "rank": []
    },
    {
        "username": "UpDownLeftDie",
        "discordusername": "updownleftdie",
        "quote": "Forced login with Roblox account and forced arbitration changes to terms of use with no easy way to opt-out kills any turst in Guilded. Theres no way I could ever trust Guilded or Roblox again with this anti-consumer behavior.",
        "rank": ["GPartner"]
    },
    {
        "username": "K_i_c_k",
        "discordusername": "k_i_c_k",
        "quote": "As a guest user, I thought I had tried this a long time ago and found it good. I created a new account on my own server to try it out for a trial, but I was only a YouTuber then. However, I had to delete my account because my Roblox account was banned. I no longer use Roblox, but things got messed up because they are deleting accounts and/or shutting down servers. I don't trust Roblox anymore. If they touch with Guilded, it would hurt because Guilded has cool features. It's a shame Guilded doesn't listen about Roblox. They don't require login requirements, but the problem is if an account is banned, users can't access it or use Roblox. I hope Guilded and Roblox listen to this. If not, people might boycott Guilded because they are deleting accounts and shutting down servers. I hope they listen, or else they don't care. It's quite painful looking for alternative platforms like Discord, such as Revolt or other options.",
        "rank": []
    },
    {
        "username": "Mascu",
        "discordusername": "mascuwu",
        "quote": "Guilded is a good alternative to Discord but not too much because it still needs to make many improvements. They have made things worse by forcing users to require a ROBLOX account which is not the good way to move forward, there are people who do not even play on ROBLOX and do not want to have a ROBLOX account to be able to use Guilded and this must stop.",
        "rank": []
    },
    {
        "username": "jrnoob",
        "discordusername": "jrnoobofficial",
        "quote": "I honestly thought that Guilded would be the best alternative to Discord until the Roblox Corporation decided to force users to integrate a Roblox account. This is honestly pretty surprising considering the fact that a corporation would make a decision that most of the community disagrees with. As a Roblox player & developer myself, this doesn't even benefit me in any shape or form. I hope you're realizing the irreversible damages that you're doing to your own chat platform; server/community shutdowns, bot shutdowns, etc. I'm pretty sure that doesn't help you guys in monetization in any form. You have lost everyone's trust, all because of your so-called improvement.",
        "rank": []
    },
    {
        "username": "Harbinger (real)",
        "discordusername": "harbingermakes",
        "quote": "I've been an avid user of Guilded for 4, nearly 5 years. I've sung its praises since the beginning, but now I can't because neither I nor anybody I know uses or cares for Roblox at all. This is a shameless attempt to inflate their userbase by Roblox, and it's going to kill Guilded.",
        "rank": []
    },
    {
        "username": "MasicoreLord",
        "discordusername": "masicorelord",
        "quote": "See that Roblox decided to pull a Microsoft on this one, and trying to force Guilded users into being on Roblox and subsequently agreeing to it's terms and conditions just to access Guilded. As you can tell, there's already quite the backlash, hope Guilded and Roblox rethink this, as it could be enough backlash to hurt Roblox's stock thus it's shareholders, which may result in it getting reversed, as remember Roblox is pubicly traded, and has to do things in the best interest of the shareholders first.",
        "rank": []
    },
    {
        "username": "Aristaous",
        "discordusername": "adminducky",
        "quote": "So sad to see Guilded being eaten up by this big corporation and adopt anti-consumer practices. Even though ROBLOX has promised to let Guilded be an independent product. I believe that the Guilded team had no control of this situation, and this all being forced down upon. I am confident that ROBLOX saw what happened with Helldivers 2, and they didn't seem to care at all. This change also straight up kicks out the users that do not use roblox, and makes the usage of guilded for non-roblox communities impossible. It's a question of time for me of when roblox will adopt their chat filter system on guilded, and you'll only be able to talk in ####### ####### ####.",
        "rank": ["GG"]
    },
    {
        "username": "notisa",
        "discordusername": "nottisa",
        "quote": "Unfortunate to see Guilded go. I originally started using Guilded two years ago to get away from Discord, and unfortunately, now it's the other way around. I'm disappointed to some extent that the projects I worked on are no longer going to be functional on Guilded. I am thankful for the skills Guilded has taught me. Failure is the result of failing to learn. If you've learned anything, you've ultimately succeeded. ~ Isa",
        "rank": []
    },
    {
        "username": "Commander_Wolf32",
        "discordusername": "commander_wolf32",
        "quote": "Trying to find a platform to move to had reminded me on why I switched to Guilded years ago, the features. What made me stay was the community, watching it all crumble like this is just so horrible, watching community's be torn up and broken, all the people I know and chat with scatter to other platforms. I feel like a fool and a lier to my friends I convinced to join after the Roblox buyout telling them that Guilded is still independent from Roblox whenever they had concerns about Roblox involvement. I am yet to decide what to do with my community I have spent so many years building on Guilded, I feel lost and blindsided by the sudden changes and overall just disappointed and sad by the situation.",
        "rank": ["GG"]
    },
    {
        "username": "Mario Wumpus",
        "discordusername": "thecoolercelluaenjoyer",
        "quote": "We just lost the best alternative to Discord because of Roblox. Hopefully Project Campground can take its place.",
        "rank": []
    },
    {
        "username": "GLaDOS",
        "discordusername": "glados3067",
        "quote": "Its a shame to see such community die a slow and painful death, to me Guilded was a respectful and kind place, not just to chill down and do nothing but also to make new friends, everyone was welcome. But seeing this so called 'feature' being pushed through our throat hurts me its not a 'oh you're still free to use email adresses to sign in feature' its a OH you need roblox or else we cant let you in feature. also BE aware that getting banned on roblox can equal a ban on Guilded aswell since its linked and connected to eachother via your roblox account!",
        "rank": []
    },
    {
        "username": "NovaAtom",
        "discordusername": "novaatom",
        "quote": "I began exploring Guilded back in early 2022 in response to Discord embracing a more corporate identity, which resulted in them bringing in a number of unnecessarily restrictive policies (e.g. privileged intents) which made the platform increasingly hostile towards developers and end users alike. It wasn't until June 2023 when I decided to fully jump ship and move my bot projects to Guilded. It's incredibly disappointing to see Guilded go down a similarly self-destructive path through their recently announced Roblox integration and forced arbitration changes. These changes are far more egregious and damaging than anything Discord has done in recent years. Guilded has always postulated itself as a libre platform that has offered a lot to its users over the course of its existence, and to their credit this has held true for the most part, hence why it has successfully attracted many prospective users and developers like myself who had become disillusioned with Discord's gross mismanagement. However, recent decisions made by Guilded have made it seem as though everything they enticed folks with were a proverbial trojan horse to effectively force its userbase into something that we unanimously didn't want to be a part of.",
        "rank": []
    },
    {
        "username": "Reisone",
        "discordusername": "reisonantia",
        "quote": "I've been using Guilded on and off since late 2018 and I always believed it was the platform to challenge Discord's status as the de-facto chat platform for gamers. Sadly after the 2021 Roblox acquisition, I feared that the platform would soon lose its way and that people would be driven away from it simply by the fact that now Guilded itself is associated with Roblox and that Roblox (a known shady corporation) would force the Guilded developers to implement changes that would negatively impact the userbase, and much to my dismay, this is exactly what has happened with the recent push for more Roblox specific features and of course, the dreaded removal of email login in favor of the Roblox account login. Personally I've already made my choice and won't be returning to Guilded in the future because of the dangerous precedent that such an action by a corporation like Roblox would entail. Sadly it seems as though Guilded lost the battle to Discord in the bitter end.",
        "rank": []
    },
    {
        "username": "Zunkz",
        "discordusername": "imzunkz",
        "quote": "I'm heavily against this change, though Guilded REFUSES to listen to their community about it. I used to run the /Furry Guild, so much for that now though, nobody should be forced to join Roblox just to be in a community. ",
        "rank": ["GPartner"]
    },
    {
        "username": "Raterix",
        "discordusername": "raterix",
        "quote": "What has gone on here is such a terrible thing, because Guilded had the potential to be a hub for all games, everything. Unfortunately, forcing users on Guilded to have a Roblox account, and not allowing you to sign up with an alternative, like an Email or Google account, is extremely limiting. This destroys all functionality when it comes to other games. It's now Roblox exclusive, weither they want to be in denial claiming 'we will still support these games' or not. Requiring a Roblox account alienates everyone but Roblox players. If I were to have a hub for Apex Legends, most of those players won't have a Roblox account and never will. I am now forced to transition the hub for my gaming company, RGL, to somewhere else.",
        "rank": ["GPartner", "GG"]
    },
    {
        "username": "ThatOneUnoriginal",
        "discordusername": "t1u",
        "quote": "As someone who has played Roblox for nearly 11 years, I'm confident in saying that Robloxians don't want Guilded (for the most part.) And I'm also confident in saying that Guilded users dont want Roblox either. Its understandable why the Roblox Corporation would want Robloxians to use Guilded over alternative platforms, but Guilded has been and still is much more then just the Roblox community. Enforcing a Roblox only login system infuriates those who do use the Guilded platform whilst not giving any additional reason for Roblox communities to start using Guilded. If the goal of Guilded is truly to 'build the best communication platform for your communities' then the only right decision would be to revert this change and allow users to continue to login or sign up using an email account. You can still provide incentives for Roblox users to use Guilded without trying to force everyone to use Roblox.",
        "rank": []
    },
    {
        "username": "Duck Dev",
        "discordusername": "serverdeveloper",
        "quote": "We wanted a oauth2 solution, good features on the api and new features on the app itself. Instead, we got the introduction of signing CDN URLs with hilarious limits, buggy app which none's interested to fix and now, mandatory Roblox Login. I joined Guilded because I saw the potential for it to be a good Discord competitor. Now, it's just a shadow of it's former self. This is what happens when a good projects gets bought by a much greater company. They just refuse to listen to community's feedback and stay silent. Roblox just destroyed Guilded and it's whole community. New Roblox users may join the platform now but, we as OGs will no longer be there. Maybe Guilded and hopefully Roblox will understand what they've done, but that is not in the near future. Goodbye Guilded and gg, you ruined it.",
        "rank": []
    },
    {
        "username": "dorianelevator",
        "discordusername": "dorianelevator",
        "quote": "definitely against this, it just sucks, what about all the people who joined guilded to chat and not just for GARBAGEblox ? oh well, they're doomed. guilded is now just a ticking time bomb waiting to explode on july 15th and kill all of its users, which is absolutely horrible, so unless guilded wants to go bankrupt or something and kill their users, they should revert this change.",
        "rank": []
    },
    {
        "username": "overkill",
        "discordusername": "overkillspree",
        "quote": "guilded i am not gonna sugercoat it even tho i have an roblox account, why cant you just let people log in with email lmao",
        "rank": []
    },
    {
        "username": "kin",
        "discordusername": "kinnn._01",
        "quote": "guilded is a platform i once absolutely admired before this change. it genuinely sucks when my admiration for this app is crushed because of a stupid agenda of forcing its beloved community and users to use roblox as a medium to use the platform. i admired the features and the development guilded had to the point i applied for GG and was dedicated to sharing this platform with others, but roblox practically (and literally) destroyed guilded by this change. i don't see myself in the future using this app whatsoever either. if anything, i hope they (guilded) would develop and revert the change.",
        "rank": []
    },
    {
      "username": "Difficultyy",
      "discordusername": "zikazodo",
      "quote": "Guilded had all the features Discord lacked or had put behind a paywall. They took very little from creators (server subscriptions) and overall, it was a place we could call home. Everything changed when Roblox bought Guilded. Everyone was excited because Guilded wouldn't shut down due to bankruptcy, but some expected a change. This change. The only reason this update was enrolled was for Guilded to gain more members, giving Roblox more popularity, thus increasing Roblox's stock prices, giving them a higher income. They don't care about the userbase. No big corporation does.",
      "rank": []
    },
    {
      "username": "helloyanis",
      "discordusername": "helloyanis",
      "quote": "I had made two main projects with Guilded, one that allowed you to play Doom through chat, as well as a reGuilded plugin for french and eventually other languages. I have spent a lot of time on these and I thought the place was nice and all, but then, you know, that happened, and I thought I wouldn't want to work for what feels  more like a part of roblox now",
      "rank": ["GG"]
    },
    {
      "username": "shorko",
      "discordusername": "shork_dev",
      "quote": "at first, guilded seemed like a pretty decent platform, and i actually used it for storing large files and then sharing them on discord, but you know what happened. i also had quite an experience with roblox, getting banned twice for absolutely garbage reasons, like posting a model with instructions on how to install it. and honestly, i kinda hate roblox. i dont want a good chat platform to be controlled (and ruined) by a corporation that cant even make normal moderation",
      "rank": []
    },
    {
      "username": "Koi",
      "discordusername": "koiske",
      "quote": "As Roblox's 'primary target audience' for the new account requirements, I'm really upset at the fact that Roblox's essentially giving the middle finger to the OG community and anyone who isn't remotely interested in Roblox. The community is what Guilded great and a viable competitor to Discord as they'd always chose to be inviting to trolls rather than give in to the 'dIsCoRd BeTteR' bait. While I know I won't be using the platform anymore unless forced to, I really hope this decision gets ultimately reversed.",
      "rank": ["GPartner", "GG"]
    },
    {
      "username": "Blox, Head lore Prophet.",
      "discordusername": "etherealmoondropmelody",
      "quote": "I think that the decision to buy out guilded wasnt bad in itself, as it gave our beloved Guilded some life support, and stated they would operate independently, they lied to our faces, and gave us the middle finger, and revoked the right to have an account not connected to your roblox account.",
      "rank": []
    },
    {
      "username": "Erkatomm",
      "discordusername": "erkatom",
      "quote": "gg Guilded. we lost to roblox 💀",
      "rank": []
    },
    {
      "username": "AtomicToast",
      "discordusername": "yourlocal_newbie",
      "quote": "ah yes, guilded. what do you think of that name before? a small happy community of people and servers. what do you think of it now? a slowly dying website because of corporate greed. and what did we lose to? roblox. not even discord, roblox. and what can we do about it? not much, to say the least. BUT, we can sign a petition against the change and hope someone over at roblox/guilded sees that the community HATES the change. cmon bois! lets show ´em what we got!",
      "rank": []
    },
    {
      "username": "KAYZA",
      "discordusername": "kayza_ish",
      "quote": "The day Roblox bought Guilded. I already knew it was pretty awful. But I never thought Roblox would sabotage Guilded this bad. Rest in peace Guilded. 😓 ",
      "rank": ["GG"]
    },
    {
      "username": "weegee",
      "discordusername": "weegeenumberone2",
      "quote": "oh no, discord's only competitor is dying because of roblox. damn you enshittification",
      "rank": []
    },
    {
      "username": "Monke",
      "discordusername": "mohammad_80524",
      "quote": "discord it is. ALSO THEY KNOW WHAT THE GUILDED DEVS ARE DOING THEY JUST MAKE THE APP DIE ON PURPOSE LIKE THEY EVEN PUT A CHANNEL CALLED ''Accounts connection feedback'' IN THE OFFICIAL GUILDED GUILD!",
      "rank": []
    },
    {
      "username": "Commenstator02",
      "discordusername": "cmdcanaryalt",
      "quote": "I was trying to make it possible to connect Roblox and Guilded seamlessly, only requiring a bot to read Guilded credentials while otherwise participating only on Roblox's game servers. I have now filtered my work off of github, because I feel the change was made to impact Roblox's bottom line at Guilded's expense. I feel Roblox is going against the mission statement of the Guilded purchase, and as a result, no longer want to be associated with either platform.",
      "rank": []
    },
    {
      "username": "Manic",
      "discordusername": "manic_cesium",
      "quote": "I wanted to migrate to guilded years ago but unfortunately it was too poorly optimized for me to use easily. So I just used it to make backup servers for my discord servers Now that Guilded is making these changes my backup servers will be mostly useless I wish I were able to just code a discord alternative myself but I cannot code for the life of me and I've had this disregarded so many times I'm just gonna immediately block whoever suggests I learn how to code",
      "rank": []
    },
    {
        "username": "Admin_Else",
        "discordusername": "admin_else",
        "quote": "Its sad to see companies ruin more shit but for anyone thinking about switching here are a few alternatives 1. Matrix matrix is a self hosteable messenger very simular to discord e2e and much more some features are missing but its pretty good. 2. Discord do i have to say anything just use vencord and and most complaints you have will go away. 3. Signal more like a whatsapp alt but really private and popular. 4. IRC something like libera.chat very old minimal and if you say oh no my ip you watched to many vpn ads.",
        "rank": []
    }
  ]
